<a href="https://colab.research.google.com/github/amberyliang/Big-Data-Analytics-and-Application-Course/blob/main/week4_missing_value.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [59]:
import pandas as pd
from sklearn import preprocessing as pp
from sklearn import impute as ip
import numpy as np
df_titanic = pd.read_csv('/content/titanic.csv')
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# check missing value

In [60]:
df_titanic.isna()
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# Drop the missing value row of "Age"

In [61]:
#tt = df_titanic.dropna(subset=['Age'], inplace = True)
df_titanic.dropna(subset=['Age'], inplace = True)
#inplace = True ->save the result
df_titanic.dropna(subset=['Age']).isna().sum()
# tt.info() #check the datatype
# tt.describe() #check the mean of the "age"

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          529
Embarked         2
dtype: int64

# Drop "Cabin" row (too much None Value)

In [62]:
#df_titanic.drop('Cabin',axis=1).info()

# Fill the column "Age" with not_recorded

In [63]:
# tt = df_titanic.fillna(value = {'Cabin':'not_recorded'})
# tt['Cabin'].unique() #all the value in specific column
df_titanic.fillna(value = {'Cabin':'not_recorded'}, inplace = True) #save the result
df_titanic['Cabin'][:10]

0     not_recorded
1              C85
2     not_recorded
3             C123
4     not_recorded
6              E46
7     not_recorded
8     not_recorded
9     not_recorded
10              G6
Name: Cabin, dtype: object

# Check the "Sex" column
replace "male" and "female" with 0 and 1

In [64]:
df_titanic['Sex'].value_counts()
df_titanic['Sex'] = df_titanic['Sex'].map({'male':0,'female':1})
# df_titanic['Sex'].value_counts()

Use another method "LabelEncoder" to transform "Sex" label

In [65]:
# le = pp.LabelEncoder()
# le.fit(['male','female'])
# print(le.classes_)
# df_titanic['Sex']= le.transform(df_titanic['Sex'])
# df_titanic['Sex'].value_counts()